# Summarize Divvy Rides
2/17/24
Note that after prepping data, I also used QGIS to geocode station and undocked ride info so it could be rolled up to community areas. See my Data Journal at https://docs.google.com/document/d/1MohXqF61nxjop6mnhESHS-18Qem5ak6XyNG_UJkhU68/edit.

Note that station data + undocked rides = total rides
4,806,289 + 868,160 = 5,674,449

### caveats
43,793 undocked rides (5% of the undocked rides, or 1% of all rides) have GPS locations outside city boundaries.
These rides are not counted in the community totals, and it is assumed that they follow a consistent pattern between January and the remainder of the year.

# Read and Review Data

### station data

In [1]:
#!pip install --upgrade pandas

In [64]:
import pandas as pd

In [65]:
df_stations = pd.read_csv("../data/04-cleaned/stations-clean-2023_02-to-2024-01.csv")

In [66]:
df_stations.head()

,start_station_name,rides_all,rides_january,rides_jan14_16,first_ride,last_ride,first_lat,first_lng,community,edit community,...,recode,community_clean,area,shape_area,perimeter,area_num_1,area_numbe,comarea_id,comarea,shape_len
0,Karlov Ave & Lawrence Ave,58,3,0,2023/10/20,2024/01/13,41.967880,-87.730414,ALBANY PARK,NaN,...,NaN,ALBANY PARK,0.0,53542230.82,0.0,14.0,14.0,0.0,0.0,39339.01644
1,Kedzie Ave & Leland Ave,2134,58,1,2023/02/01,2024/01/31,41.966463,-87.708333,ALBANY PARK,NaN,...,NaN,ALBANY PARK,0.0,53542230.82,0.0,14.0,14.0,0.0,0.0,39339.01644
2,Monticello Ave & Lawrence Ave,216,23,0,2023/09/20,2024/01/31,41.968058,-87.719664,ALBANY PARK,NaN,...,NaN,ALBANY PARK,0.0,53542230.82,0.0,14.0,14.0,0.0,0.0,39339.01644
3,N Shore Channel Trail & Argyle St,1128,22,0,2023/02/01,2024/01/29,41.970000,-87.703086,ALBANY PARK,NaN,...,NaN,ALBANY PARK,0.0,53542230.82,0.0,14.0,14.0,0.0,0.0,39339.01644
4,Public Rack - 4810 Keeler Ave,56,0,0,2023/05/12,2023/12/18,41.968245,-87.733088,ALBANY PARK,NaN,...,NaN,ALBANY PARK,0.0,53542230.82,0.0,14.0,14.0,0.0,0.0,39339.01644

In [67]:
# stations
len(df_stations)

1597

In [68]:
# rides
df_stations['rides_all'].sum()

4806289

### undocked rides

In [69]:
df_undocked_locations = pd.read_csv("../data/04-cleaned/undocked-locations-geocoded.csv")

In [70]:
df_undocked_locations=df_undocked_locations.rename(columns={"community":"community_clean"})

In [71]:
df_undocked_locations

,start_lat,start_lng,rides_all,rides_january,rides_jan14_16,first_ride,last_ride,community_clean,area,shape_area,perimeter,area_num_1,area_numbe,comarea_id,comarea,shape_len
0,41.83,-87.62,1361,38,1,2023/02/02,2024/01/31,DOUGLAS,0.0,4.600462e+07,0.0,35.0,35.0,0.0,0.0,31027.054510
1,41.84,-87.62,1972,42,0,2023/02/01,2024/01/31,DOUGLAS,0.0,4.600462e+07,0.0,35.0,35.0,0.0,0.0,31027.054510
2,41.84,-87.61,1294,5,0,2023/02/01,2024/01/19,DOUGLAS,0.0,4.600462e+07,0.0,35.0,35.0,0.0,0.0,31027.054510
3,41.82,-87.60,614,6,0,2023/02/10,2024/01/31,OAKLAND,0.0,1.691396e+07,0.0,36.0,36.0,0.0,0.0,19565.506153
4,41.83,-87.61,1164,23,0,2023/02/01,2024/01/31,OAKLAND,0.0,1.691396e+07,0.0,36.0,36.0,0.0,0.0,19565.506153
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
725,42.07,-87.72,7,0,0,2023/05/18,2023/11/21,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
726,42.07,-87.71,16,0,0,2023/04/09,2023/12/24,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
727,42.07,-87.70,33,0,0,2023/02/18,2023/12/05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
728,42.07,-87.69,79,1,0,2023/02/06,2024/01/08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
729,42.07,-87.68,64,0,0,2023/03/31,2023/12/03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [72]:
df_undocked_locations['rides_all'].sum()

868160

In [73]:
df_undocked_locations.head()

,start_lat,start_lng,rides_all,rides_january,rides_jan14_16,first_ride,last_ride,community_clean,area,shape_area,perimeter,area_num_1,area_numbe,comarea_id,comarea,shape_len
0,41.83,-87.62,1361,38,1,2023/02/02,2024/01/31,DOUGLAS,0.0,4.600462e+07,0.0,35.0,35.0,0.0,0.0,31027.054510
1,41.84,-87.62,1972,42,0,2023/02/01,2024/01/31,DOUGLAS,0.0,4.600462e+07,0.0,35.0,35.0,0.0,0.0,31027.054510
2,41.84,-87.61,1294,5,0,2023/02/01,2024/01/19,DOUGLAS,0.0,4.600462e+07,0.0,35.0,35.0,0.0,0.0,31027.054510
3,41.82,-87.60,614,6,0,2023/02/10,2024/01/31,OAKLAND,0.0,1.691396e+07,0.0,36.0,36.0,0.0,0.0,19565.506153
4,41.83,-87.61,1164,23,0,2023/02/01,2024/01/31,OAKLAND,0.0,1.691396e+07,0.0,36.0,36.0,0.0,0.0,19565.506153

# Aggregate and Merge Stations with Undocked Locations

### roll up stations by community
CCA = Chicago Community Area

In [74]:
df_cca_stations = df_stations.groupby('community_clean').agg(
    n_annual_st=('rides_all','sum'),
    n_january_st=('rides_january','sum'),
    n_jan1416_st=('rides_jan14_16','sum'),
    n_stations_st=('start_station_name','count')
).reset_index()

In [75]:
df_cca_stations

   community_clean  n_annual_st  n_january_st  n_jan1416_st  n_stations_st
0      ALBANY PARK         4459           134             1             19
1   ARCHER HEIGHTS        44087          1396            30             14
2    ARMOUR SQUARE        17515           416            10              9
3          ASHBURN          399            33             1             36
4   AUBURN GRESHAM          657            15             1             32
..             ...          ...           ...           ...            ...
73       WEST LAWN        31674          1081            40             19
74    WEST PULLMAN          379             5             0             12
75      WEST RIDGE         9091           221             0             26
76       WEST TOWN       224070          5561            85             34
77        WOODLAWN        42147          2070            55             21

[78 rows x 5 columns]

In [76]:
df_cca_stations['n_annual_st'].sum()

4806289

### roll up undocked locations by community

In [77]:
# handle nulls
df_undocked_locations['community_clean'] = df_undocked_locations['community_clean'].fillna('uncoded')

In [78]:
df_cca_undocked = df_undocked_locations.groupby('community_clean').agg(
    n_annual_ud=('rides_all','sum'),
    n_january_ud=('rides_january','sum'),
    n_jan1416_ud=('rides_jan14_16','sum'),
    n_locations_ud=('start_lat','count')
).reset_index()

In [79]:
df_cca_undocked.head()

  community_clean  n_annual_ud  n_january_ud  n_jan1416_ud  n_locations_ud
0     ALBANY PARK         2576            33             0               4
1  ARCHER HEIGHTS          513             8             0               5
2   ARMOUR SQUARE         7287           133             1               4
3         ASHBURN          346             8             0              15
4  AUBURN GRESHAM          373             3             0               9

In [80]:
df_cca_undocked['n_annual_ud'].sum()

868160

In [81]:
df_cca_stations['n_annual_st'].sum() + df_cca_undocked['n_annual_ud'].sum()

5674449

### merge undocked rides with stations

In [82]:
df_communities = pd.merge(df_cca_stations,df_cca_undocked,on='community_clean',how='outer')

In [83]:
df_communities.head()

,community_clean,n_annual_st,n_january_st,n_jan1416_st,n_stations_st,n_annual_ud,n_january_ud,n_jan1416_ud,n_locations_ud
0,ALBANY PARK,4459.0,134.0,1.0,19.0,2576.0,33.0,0.0,4.0
1,ARCHER HEIGHTS,44087.0,1396.0,30.0,14.0,513.0,8.0,0.0,5.0
2,ARMOUR SQUARE,17515.0,416.0,10.0,9.0,7287.0,133.0,1.0,4.0
3,ASHBURN,399.0,33.0,1.0,36.0,346.0,8.0,0.0,15.0
4,AUBURN GRESHAM,657.0,15.0,1.0,32.0,373.0,3.0,0.0,9.0

In [84]:
### convert back to int, addressing problem of only stations dataset having an EVANSTON record
# and only undocked dataset having an uncoded record

In [85]:
df_communities = df_communities.fillna(0)
numeric_cols = df_communities.columns.drop('community_clean')
df_communities[numeric_cols] = df_communities[numeric_cols].astype(int)
df_communities.head()

,community_clean,n_annual_st,n_january_st,n_jan1416_st,n_stations_st,n_annual_ud,n_january_ud,n_jan1416_ud,n_locations_ud
0,ALBANY PARK,4459,134,1,19,2576,33,0,4
1,ARCHER HEIGHTS,44087,1396,30,14,513,8,0,5
2,ARMOUR SQUARE,17515,416,10,9,7287,133,1,4
3,ASHBURN,399,33,1,36,346,8,0,15
4,AUBURN GRESHAM,657,15,1,32,373,3,0,9

### calculate monthly and anual totals

In [86]:
df_communities['total_annual']=df_communities['n_annual_st'].fillna(0)+df_communities['n_annual_ud'].fillna(0)
df_communities['total_january']=df_communities['n_january_st'].fillna(0)+df_communities['n_january_ud'].fillna(0)
df_communities['total_jan1416']=df_communities['n_jan1416_st'].fillna(0)+df_communities['n_jan1416_ud'].fillna(0)

In [87]:
df_communities.tail()

,community_clean,n_annual_st,n_january_st,n_jan1416_st,n_stations_st,n_annual_ud,n_january_ud,n_jan1416_ud,n_locations_ud,total_annual,total_january,total_jan1416
74,WEST PULLMAN,379,5,0,12,283,3,0,9,662,8,0
75,WEST RIDGE,9091,221,0,26,3456,51,0,7,12547,272,0
76,WEST TOWN,224070,5561,85,34,80643,1686,2,15,304713,7247,87
77,WOODLAWN,42147,2070,55,21,3630,99,0,5,45777,2169,55
78,uncoded,0,0,0,0,43793,598,1,137,43793,598,1

### calculate January as percent of average month

In [88]:
df_communities['monthly_avg']=df_communities['total_annual']/12
df_communities['daily_avg']=df_communities['total_annual']/365

In [89]:
df_communities['pct_january']=100*df_communities['total_january']/df_communities['monthly_avg']
df_communities['pct_jan1416']=100*df_communities['total_jan1416']/df_communities['daily_avg']

### verify totals

In [90]:
n_merged = df_communities['total_annual'].sum()
n_merged

5674449

### for display, remove communities with low number of total rides
3 rides per day * 365 days = 1095 minimum, round down to 1,000

In [95]:
df_communities['dsp_pct_january'] = pd.Series(dtype='float64')
df_communities.loc[df_communities['total_annual']>=1000,'dsp_pct_january']=df_communities['pct_january']

In [96]:
df_communities.head()

,community_clean,n_annual_st,n_january_st,n_jan1416_st,n_stations_st,n_annual_ud,n_january_ud,n_jan1416_ud,n_locations_ud,total_annual,total_january,total_jan1416,monthly_avg,daily_avg,pct_january,pct_jan1416,dsp_pct_january
0,ALBANY PARK,4459,134,1,19,2576,33,0,4,7035,167,1,586.250000,19.273973,28.486141,5.188344,28.486141
1,ARCHER HEIGHTS,44087,1396,30,14,513,8,0,5,44600,1404,30,3716.666667,122.191781,37.775785,24.551570,37.775785
2,ARMOUR SQUARE,17515,416,10,9,7287,133,1,4,24802,549,11,2066.833333,67.950685,26.562374,16.188211,26.562374
3,ASHBURN,399,33,1,36,346,8,0,15,745,41,1,62.083333,2.041096,66.040268,48.993289,NaN
4,AUBURN GRESHAM,657,15,1,32,373,3,0,9,1030,18,1,85.833333,2.821918,20.970874,35.436893,20.970874

In [97]:
len(df_communities)

79

# Rank by Community

### prepare simplified version of dataframe

In [98]:
df_summary = df_summary.drop(df_summary[df_summary['community_clean']=='uncoded'].index)
df_summary = df_summary[['community_clean','dsp_pct_january','total_annual','total_january','monthly_avg']]
df_summary['community']= df_summary['community_clean'].str.title()
df_summary

,community_clean,dsp_pct_january,total_annual,total_january,monthly_avg,community
0,ALBANY PARK,28.486141,7035,167,586.250000,Albany Park
1,ARCHER HEIGHTS,37.775785,44600,1404,3716.666667,Archer Heights
2,ARMOUR SQUARE,26.562374,24802,549,2066.833333,Armour Square
3,ASHBURN,NaN,745,41,62.083333,Ashburn
4,AUBURN GRESHAM,NaN,1030,18,85.833333,Auburn Gresham
...,...,...,...,...,...,...
73,WEST LAWN,40.622209,32465,1099,2705.416667,West Lawn
74,WEST PULLMAN,NaN,662,8,55.166667,West Pullman
75,WEST RIDGE,26.014187,12547,272,1045.583333,West Ridge
76,WEST TOWN,28.539642,304713,7247,25392.750000,West Town
77,WOODLAWN,56.858248,45777,2169,3814.750000,Woodlawn

In [99]:
df_summary_valid= df_summary[df_communities['dsp_pct_january'].notna()]

/tmp/ipykernel_1496/1439355607.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_summary_valid= df_summary[df_communities['dsp_pct_january'].notna()]

### calculate top and bottom 5 rankings

In [100]:
#top communities for January riding
df_jan_top5 = df_summary_valid.sort_values(by='dsp_pct_january',ascending=False).head()
df_jan_top5

,community_clean,dsp_pct_january,total_annual,total_january,monthly_avg,community
70,WEST ELSDON,61.663075,26914,1383,2242.833333,West Elsdon
77,WOODLAWN,56.858248,45777,2169,3814.750000,Woodlawn
34,HYDE PARK,53.807151,69225,3104,5768.750000,Hyde Park
69,WASHINGTON PARK,53.612511,23211,1037,1934.250000,Washington Park
24,EVANSTON,46.986668,30979,1213,2581.583333,Evanston

In [101]:
#bottom communities for January riding
df_jan_last5 = df_summary_valid.sort_values(by='dsp_pct_january',ascending=False).tail()
df_jan_last5

,community_clean,dsp_pct_january,total_annual,total_january,monthly_avg,community
49,NEAR SOUTH SIDE,15.281501,20888,266,1740.666667,Near South Side
71,WEST ENGLEWOOD,14.077253,52425,615,4368.750000,West Englewood
9,BEVERLY,6.118587,38048,194,3170.666667,Beverly
4,AUBURN GRESHAM,NaN,1030,18,85.833333,Auburn Gresham
55,NORWOOD PARK,NaN,1067,26,88.916667,Norwood Park

# Export

### For Analysis

In [48]:
df_communities.to_csv("../results/rides-by-community.csv", index=False)

### For Visualization

In [63]:
df_jan_top5.to_csv("../results/dw-top5-january.csv", index=False)
df_jan_last5.to_csv("../results/dw-last5-january.csv", index=False)
df_summary.to_csv("../results/flourish-map-january.csv", index=False)